[
  {
    "path": "posts/2021-02-19-dataviz-makeover-2/",
    "title": "Dataviz Makeover 2",
    "description": "This post is on a makeover of a data visualisation created on a study to understand the willingness of the public on Covid-19 vaccination.",
    "author": [
      {
        "name": "Lance Teo Chye Teck",
        "url": "https://www.linkedin.com/in/lanceteoct/"
      }
    ],
    "date": "2021-02-19",
    "categories": [],
    "contents": "\r\nOriginal Visualisation\r\nOriginal VisualisationData Source\r\nThe data used by the research team was obtained from Imperial College London YouGov Covid 19 Behaviour Tracker Data Hub hosted at Github. The research mainly utilised survey conducted on January 2021. The field vac-1: If a Covid-19 vaccine were made available to me this week, I would definitely get it: of the survey is used to prepare the data visualisation.\r\nThe Task\r\na. Critic the data visualisation from both its clarity and aesthetics. At least three from each evaluation criterion.\r\nClarity\r\nThere is no indication of how many respondents are there for each country so it might be mislead the reader thinking that the number of respondents of each country are the same.\r\nSince both of the original visualisations are bar charts (stacked and horizontal respectively), having different X-axis scale might mislead readers. The horizontal chart for “Strongly Agree” on the right with X-axis range from 0% to 60% looks much longer than the stacked bar chart on the left with x-axis range from 0% to 100% even though they should be of the same size.\r\nThe legend indicated “Vac 1” which is the alias for the survey question “If a Covid-19 vaccine were made available to me this week, I would definitely get it.”, but there is no mention of it anywhere. This might confuse readers on the meaning of “Vac 1”.\r\nThe stacked bar chart on the left is not easy to quickly see the proportions of disagree, agree, and neutral as there is no central guide to guide the readers.\r\nThe horizontal bar chart on the right did not take into considerations of uncertainty.\r\nAesthetics\r\nThere is no specific meaning to the colour scheme chosen and might confuse readers. For example, red is usually used for negative connotation and green is usually used for positive connotation, which should be used for disagree and agree respectively. However, red is used for neutral and green is used for “disagree” which is of a negative connotation.\r\nWrong spelling of “Vaccine” in the left chart title.\r\nThe legend was not labeled clearly and fully as only 1 and 5 are shown as “Strongly Agree” and “Strongly Disagree” respectively. 2, 3, and 4 were not labeled and were left to readers to derive.\r\nThe sorting order of the legend also differs from the actually presented order of the data in the visualisation. The order in the visualisation starts from strongly disagree on the left to strongly agree on the right, while the legend sorted in the opposite way from top to down. This is harder for the readers to compare and reference.\r\nb. With reference to the critics above, suggest alternative graphical presentation to improve the current design. Sketch out the proposed design. The proposed alternative design should include interactive techniques. Support your design by describing the advantages or which part of the issue(s) your alternative design try to overcome.\r\nProposed Visualisation\r\nProposed VisualisationClarity\r\nAdd a tooltip to indicate the number of responses for each selected elements of the graph, and add a dynamic title to show total number of respondents.\r\nSince we are changing the horizontal bar chart to a scatter plot with confidence interval, there is no need to sync the x-axis range as there is no similar element (bars) to compare, and thus, no confusion.\r\nThe proposed visualisation will be able to dynamically change the survey question and display the full question, rather than the alias e.g. Vac 1, in a dynamic title. This will make sure the readers know what is the actual context for the visualisation.\r\nA diverging stacked bar with neutral response being centralised is used. This chart allows readers to quickly see the proportion of agree and disagree in a glance.\r\nUncertainty line is added to the proposed scatter chart to indicate the standard of errors at selected confidence interval.\r\nAesthetics\r\nRed is used to indicate negative connotation (i.e. strongly disagree and disagree with the prior of a darker shade) and green is used to indicate positive connotation (i.e. strongly agree and agree with the prior of a darker shade.). Grey which is a neutral colour by nature is used for the “neutral” response.\r\nCorrect the spelling, if required.\r\nThe number 1 to 5 are taken out of the legend and replaced with the actual meaning. i.e. strongly agree, agree, neutral, disagree, and strongly disagree.\r\nThe legend will be sorted according to the order in the visualisation, from strongly agree to strongly disagree, so that it is easier for readers to reference.\r\nc. Using Tableau, design the proposed data visualisation.\r\nd. Provide step-by-step description on how the data visualisation was prepared.\r\nData Preparation\r\nWe are provided with data sets from 29 countries. For the purpose of this makeover, we are using only the same data sets from the same 14 countries used i.e. Australia, Canada, Denmark, Finland, France, Germany, Italy, Japan, Netherlands, Norway, Singapore, South Korea, Sweden, and United Kingdom.\r\nThe data provided also contains many more columns or fields that we need. Tableau Public might takes too long to load if the dataset is too big so we will trim the data down to those that we need. All the data cleaning is done via Excel.\r\nAll FieldsWe are only extracting the following fields:\r\nRecordNo\r\nendtime\r\nhousehold_children\r\nage\r\ngender\r\nhousehold_size\r\nemployment_status (4 data sets have 7 of these columns - take all of them)\r\nvac_1\r\nvac2_1\r\nvac2_2\r\nvac2_3\r\nvac2_6\r\nvac_3\r\nSelected FieldsAs mentioned in Step 2, there are 4 data sets with employment_status “unpivoted” with the answer in different columns and boolean value (1 or 0).\r\nThe 4 data sets are:\r\nDenmark\r\nFinland\r\nNorway\r\nSweden\r\nUnpivoted Employment StatusAn Excel formula is used to combine the 7 columns into 1 column and mapped into the proper employment status using another formula as shown.\r\n\r\nReference Sheet for mapping.\r\nOnce the data sets are cleaned, we will import the data set into Tableau.\r\nSelect the following columns and click pivot.\r\nvac_1\r\nvac2_1\r\nvac2_2\r\nvac2_3\r\nvac2_6\r\nvac_3\r\nRename the Pivot Column and Pivot Value to Questions and Score_raw respectively.\r\nRemove the initial data set from the board and double-click on Union. Select Manual Union and drag in all the data sets.\r\nGo to the last column called Table. Rename the column to Country and create alias as follows.\r\nData is now prepped for visualisation.\r\nCreating the Diverging Stacked Bar Chart\r\nCreate a calculated field called “Score” with the following formula.\r\nScore - Calculated FieldCreate calculated field called “Answer” with the following formula.\r\n 3. Click on the menu button of the Answer field and click Sort. Sort Answer by Score.\r\nSort AnswerCreate a calculated field called Negative Scores with the following formula.\r\nNegative Scores - Calculated FieldCreate a calculated field called Total Negative Scores with the following formula and click on Default Table Calculation. Compute using Answer.\r\n 6. Create a calculated field called Total Scores with the following formula and click on Default Table Calculation. Compute using Answer.\r\n 7. Create a calculated field called Gantt Start using the following formula.\r\nGantt Start - Calculated FieldCreate a calculated field called Percent of Total Sizing using the following formula.\r\nPercent of Total Sizing - Calculated FieldCreate a calculated field called Gantt Percent using the following formula and click on Default Table Calculation. Compute using Answer.\r\nGantt Percent - Calculated FieldDrag Gantt Percent to Columns and Country to Rows.\r\nRows and ColumnsGo to Marks and drag Answer to Color, Percent of Total Sizing to Size, and Number of Records to Detail as shown below. Change chart type from Automatic to Gantt Bar.\r\nMarksClick on the legend on the top right and click Sort. Sort Answer by Field Score (Minimum) in Descending Order.\r\nLegend SortRight click on the Null value in the Legend and click Exclude.\r\nLegend - Exclude NullUnder Marks, click on Color > Edit Colors… and choose appropriate colours for each answer as shown below.\r\nStrongly Disagree - Dark Red\r\nDisagree - Red\r\nNeutral - Light Grey\r\nAgree - Green\r\nStrongly Agree - Dark Green\r\n\r\n15. Right-click on the X-axis and click Edit Axis… Change to Fixed and change Fixed Start to -1 and Fixed End to 1.\r\n\r\nRight-click on the X-axis and click Add reference line. Select Constant and change value to 0. Change the line to a dashed line and select dark grey colour.\r\n\r\n17. Double-click on the Title and change title to Opinions to Selected Question.\r\n 18. In preparation to the dynamic dashboard later, add the following fields to Filters.\r\nQuestions\r\ngender\r\nemployment_status\r\nage\r\nendtime\r\nhousehold_size\r\nhousehold_children\r\nFilterRight-click on each of the filters and Apply to Worksheets > All Using This Data Source.\r\n 20. Add Number of Records to Details. Double-click on Tooltip and enter the following.\r\nTooltipAnd the first visualisation: Diverging Stacked Bar Chart is done.\r\nDiverging Stacked Bar ChartCreating the Scatter Plot with Standard Error Line\r\nCreate a calculated field called “Score 1” using the formula below.\r\nScore 1Create a calculated field called “% Score 1” using the formula below.\r\n% Score 1Create a calculated field called “Prop” using the formula below.\r\nPropRight-click on Dimension and click Create Parameter. Call it Confidence Interval and add in all the different Confidence Intervals with their respective Z score. Following the settings as follow. Right-click the Confidence Interval parameter and click Show Parameter Control.\r\nParameter - CI 1Parameter - CI 2Parameter - CI 3Create a calculated field called “Prop SE” using the formula below.\r\nProp SECreate a calculated field called “Prop_Margin of Error” using the formula below.\r\nProp_ SE_Margin of ErrorCreate a calculated field called “Prop_Lower Limit” using the formula below.\r\nProp_Lower LimitCreate a calculated field called “Prop_Upper Limit” using the formula below.\r\nProp_Upper LimitDrag Measure Values to Columns and Country to Rows.\r\nCols and RowsRemove all from Measure Values except “Prop_Upper Limit” and “Prop_Lower Limit” as shown.\r\nMeasure ValuesGo to Marks, Change Chart Type to Line, and Crtl+Drag Measure Names to Color, Details and Path.\r\nMarksDrag Prop to Columns to the right of Measure Values. Right-click in it > Select Dual Axis > Select Synchronize Axis.\r\nProp to ColumnsRight-click on Country and Sort. Sort by Prop in Descending Order.\r\nSort countryAdjust the size of the line and circle accordingly.\r\nChange colours of Prop, Prop_Lower Limit, and Prop_Upper Limit to Dark Green (Colour of Strongly Agree). Change Colour Opacity of Prop_Lower Limit and Prop_Upper Limit to 24%.\r\nProp ColoursRight-click on the X-axis at the top and uncheck Show Header.\r\nHide AxisGo to Analysis > Totals > Show Column Grand Totals > Column Grand Totals to Top.\r\nGrand TotalsRight click on X-axis > Format > Change to Percentage (1 decimal point).\r\nFormat AxisDouble-click on Title and change to the following.\r\nTitleGo to Marks > AGG(Prop) > Change to Circle type chart > Drag AGG(Prop) to Label.\r\nLabelAnd the second visualisation: Scatter Plot with Standard Error Line is done.\r\nScatter Plot with Standard Error LineDynamic Title\r\nCreate a New Worksheet. Go to Marks and drag Questions, Score 1, Number of Records, and Prop into Detail. Change chart type to Polygon.\r\nMarksDouble-click on the title and change to the following.\r\nFormat TitleRight-click on AGG(Prop) > Format > Change to Percentage (1 decimal point).\r\n\r\nAnd you have a dynamic title for the dashboard later.\r\nDynamic TitleCreating the Dashboard\r\nCreate a New Dashboard. Drag both visualisations created onto the dashboard. Diverging Stacked Bar Chart on the left and Scatter Plot with Standard Error Line on the right, as shown below.\r\nDashboard 1Right-click on the Diverging Stacked Bar Chart > Filter > Select all the filters that we have prepared earlier as shown below.\r\nDashboard 2Format the Filter according to your preference and line them neatly on top of the 2 visualisations. Drag the dynamic title created earlier below the filters.\r\n\r\nDouble-click on the Dashboard Title and format it to your preference, or follow the format below.\r\nDashboard 5And the dashboard is done.\r\nDashboard 6e. Describe three major observations revealed by the data visualisation prepared.\r\nMany are probably worried about potential side effects of vaccine that are created in about 1 short years (vaccine usually takes many more years to create) and are waiting for at least a year later before they can fully accept the vaccine.\r\nThis can be seen in the huge increase in the proportion of those who agree or strongly agree to the question “If a Covid-19 vaccine were made available to me a year from now, I definitely intend to get it” from that of the question “If a Covid-19 vaccine were made available to me this week, I would definitely get it.”.\r\nThe responses to the question “I am worried about the potential side effects of a COVID-19 vaccine.” are also steering more towards the Agree and Strongly Agree side, which confirmed our observation above.\r\nAnimated Transition - Vaccine made within a week versus a year.\r\nResponses for Question\r\n“If a Covid-19 vaccine were made available to me a year from now, I definitely intend to get it”. \r\nResponses for Question\r\n“If a Covid-19 vaccine were made available to me this week, I would definitely get it.”.\r\nThe responses from the above questions also give us insights on which are the countries that are most open to Covid-19 vaccination at the moment. The result consistently rank (1) United Kingdom and (2) Denmark as the top countries who has the highest proportion of Strongly Agree for Covid-19 vaccination-related questions.\r\nWhich is also not surprising that they are the countries least worried about the potential side effects of Covid-19 vaccination.\r\nResponses for Question\r\n“If a Covid-19 vaccine were made available to me a year from now, I definitely intend to get it”.\r\nResponses for Question\r\n“If a Covid-19 vaccine were made available to me this week, I would definitely get it.”. Responses for Question\r\n“If I do not get a Covid-19 vaccine when it is available, I will regret it.”.\r\nThe older you are, the more open you are to Covid-19 vaccination and would not mind getting the vaccination if made available within a week. The tipping point is at around age 40. This could be due to the heavier responsibilities that come with age especially around age 40 when people probably got married with kids and further down, being a grandparent and wanting to see your grandchildren grows up.\r\nAnimated Transition - Vaccine made available in a week against Age \r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-02-19T19:19:04+08:00",
    "input_file": "dataviz-makeover-2.utf8.md"
  },
  {
    "path": "posts/2021-01-27-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "This post is on makeover of a data visualisation published on a Report called \"Labour Force in Singapore 2019\" \nby Ministry of Manpower (MOM) Singapore.",
    "author": [
      {
        "name": "Lance Teo Chye Teck",
        "url": "https://www.linkedin.com/in/lanceteoct/"
      }
    ],
    "date": "2021-01-27",
    "categories": [],
    "contents": "\r\nThe Original Visualisation\r\nOriginal VisualisationData Source\r\nThe original source of this chart can be found on page 22 of Report: Labour Force in Singapore 2019.\r\nThe data is available at https://stats.mom.gov.sg/Pages/Labour-Force-Tables2019.aspx,\r\nTable 5: RESIDENT LABOUR FORCE PARTICIPATION RATE BY AGE AND SEX, 2009 - 2019 (JUNE).\r\nThe Task\r\na. Critic the graph from both its clarity and aesthetics. At least three from each evaluation criterion.\r\nClarity\r\nBy using overlapping line charts for the two different years, it is able to show the increase or decrease for the various age group clearly. However, line graph is normally used to show trend over time, hence, it may be confuse the audience thinking that there is a relationship between the different age groups.\r\nThe chart title is stated as “Resident labour force by age” and sub-titled “Per Cent”. There is no “%” symbol used for the whole chart. It is hard to visualise that chart is illustrating the percentage share of resident labour force by looking at the chart alone.\r\nThe lead-in statement accompanying the data visualisation mentioned Labour Force Participation Rate (LFPR) a few times as a comparison to the percentage share of Resident Labour Force by Age Group, but there is no indication of LFPR within the visualisation. The visualisation is mainly describing the percentage share of the Labour Force by Age, and not LFPR.\r\nThe lead-in statement also mentioned age group that are not seen within the visualisation such as age group 25-54 and age group 55 & over.\r\nAesthetics\r\nGood use of 2 contrasting colours (Dark Blue and Grey) to differentiate the two different years and using the brighter colour as a highlight for the later year (i.e. 2019).\r\nThe given month (June) for the label/legend for the data table is insignificant and distracting.\r\nPutting the data label in the data table at the bottom of the chart is hard to relate the data to the chart.\r\nb. With reference to the critics above, suggest alternative graphical presentation to improve the current design. The proposed alternative data visualisation must be in static form. Sketch out the proposed design. Support your design by describing the advantages or which part of the issue(s) your alternative design try to overcome.\r\nProposed VisualisationClarity\r\nThe initial line graph is changed to a side-by-side bar chart to make it clearer that there is no time-series trend portrayed in the visualisation.\r\nThe chart is clearly labeled as “% share of Resident Labour Force” so that the audience would be clear it is a percentage and not a number.\r\nAdditional chart is added to show how LFPR has changed for the different age groups from 2009 to 2019. It is also strategically placed on top of the revised side-by-side bar chart to align the x-axis (Age Group) for better comparison. A dumbbell chart is used to better portray the magnitude of the changes in each of the age group from 2009 to 2019.\r\nTwo additional charts are created with a more aggregated age group which were mentioned in the lead-in statement and also available in the dataset (i.e. 15-24, 25-64, 65 & Over). Both are an aggregated version of the side-by-side bar chart and dumbbell chart, and are strategically places on the right of respectively graph for better comparison.\r\nAesthetics\r\nBoth dark blue and grey colours are retained and used in all 4 charts. An additional golden yellow colour is used for the dumbbell chart to better highlight the changes of the LFPR between 2009 and 2019.\r\nRemove all unnecessary legend and focus on using colours to differentiate the two different years. A legend is added to the top right.\r\nThe data table is removed and data labels are added to all points. This allows users to view each data point in static form.\r\nc. Using Tableau, design the proposed data visualization.\r\nLink to Proposed Data Visualisation in Tableau Public\r\nd. Provide step-by-step description on how the data visualization was prepared.\r\nData Preparation\r\n2 datasets were used for this data visualisation:\r\n(5) Resident Labour Force Participation Rate by Age and Sex, 2009 - 2019 (June)\r\n(7) Resident Labour Force Aged Fifteen Years and Over by Age and Sex, 2009 - 2019 (June)\r\nScreenshots of the raw dataset are as shown below:\r\n However, we do not need many of the data and there are also some data that we need but not available in the dataset. Therefore, a transformation is done to extract the data that we need for the data visualisation.\r\nThe data transformation steps (done in Microsoft Excel) are as follows:\r\nFor both tables, removed data for year 2010 to 2018\r\nFor Table 7, compute the % Share of Resident Labour Force by taking the resident labour force of each age group divided by the total resident labour force for both years (2009 and 2019). e.g. for age group 15 - 19 in year 2009, we take 31.8 divide by 1985.7 which gives us 0.016 or 16%.\r\nFor Table 5, the LFPR data were given in percentage instead of a decimal (e.g. 88% instead of 0.88). A decimal is preferred for data visualisation in Tableau so we transformed the percentage into decimal by dividing the given data by 100. e.g. 88 divide 100 gives us 0.88.\r\nNext for both table, the data were manually pivoted by year and age group.\r\nLastly, both tables are manually merged into one table.\r\nThe transformed dataset is shown below:\r\n\r\nAs you may have noticed, there are some null values in the % Share of Resident Labour Force column. There is no problem here since we are not using these data points so we will leave it as null.\r\nLastly, we loaded this dataset into Tableau.\r\nSome steps that we took after loading the dataset:\r\nChange the connection type (located at the top right) from Live to Extract since it was noted that Tableau Public does not work very well with live local dataset. \r\nChanged data type of Year column from Number (whole) to Date \r\nAnd we are all set for the real work!\r\nSide-by-side Bar Chart\r\nBelow are the steps for our side-by-side bar chart:\r\nDrag Age Group and Year from Dimensions to Columns and % Share of Resident Labour Force from Measures to Rows.\r\nbar-step-01Drag Age Group to Filters and select the age groups that we want.\r\ni.e. 15-24, 25-29, 30-34, 35-39, 40-44, 45-49, 50-54, 55-59, 60-64, 65-69, 70 & Over\r\nbar-step-02Under Marks, change the chart type to Bar and drag Year to Color.\r\nClick on Color and click on Edit Colors. Change colours of year 2009 and 2019 to #adadad and #0000d3 respectively under the HTML on the bottom right.\r\nRight click on the X-Axis and untick Show Header. \r\nRight click on the Y-Axis and click on Edit Axis. \r\nChange the Range to Fixed and change the *Fixed end to 1**. \r\nRight click on the Y-Axis again and untick Show Header.\r\nDrag % Share of Resident Labour Force to Label under Marks.\r\nClick on the Down Arrow that appears when you hover over the added label and click on Format.\r\nUnder Default >> Numbers, choose Percentage and select 2 decimal places.\r\nRename current sheet to % Share of Resident Labour Force (2009 vs 2019).\r\nTo remove the grid lines, first right click on the chart and click Format.\r\nClick on the Border icon and select Rows. Under Grid Lines, select None. \r\nAnd you got your 1st completed side-by-side bar chart for all age groups.\r\nTo create the 2nd side-by-side bar chart for aggregated age groups (15-24, 25-64, and 65 & Over), right click the current sheet at the bottom of the screen and click Duplicate.\r\nNavigate to the duplicated sheet and select the columns that want to group together (e.g. 15-19 and 20-24), right click, and select Group.\r\nRight click on the grouped column and click on Edit Alias.\r\nRename the group accordingly e.g. in this case 15 - 24. Repeat step 17-19 for the rest of the age groups i.e. 25-64 and 65 & Over\r\nRename the new sheet to % Share of Resident Labour Force (2009 vs 2019) - Aggregated.\r\nAnd you got your 2nd side-by-side bar chart for the aggregated age groups.\r\nDumbbell Chart\r\nBelow are the steps for dumbbell chart:\r\nDrag Age Group from Dimensions to Columns and LFPR from Measures to Rows 2 times. Right click on one of the LFPR and select Dual Axis.\r\ndb-01Drag Age Group to Filters and select the age groups that we want.\r\ni.e. 15-24, 25-29, 30-34, 35-39, 40-44, 45-49, 50-54, 55-59, 60-64, 65-69, 70 & Over\r\ndb-02Right click on the Y-Axis and select Format. Click on Numbers and change to Percentage at 1 decimal place.\r\nUnder Marks, go to the first SUM(LFPR).\r\nChange the chart type to Line.\r\nClick on Size and adjust to approximately 95% of the slider.\r\nDrag Year from Dimension to the Line icon and drag LFPR from Measure to the Label icon. \r\nClick on Color and select the Yellow that was selected in the screenshot below. Adjust the Opacity to 58%.\r\nNavigate to second SUM(LFPR) under Mark and change the chart type to Circle.\r\nDrag Year from Dimension to Color.\r\nRight click on the Y-Axis and select Synchronize Axis.\r\nAnd then right click on the Y-Axis again and untick Show Header.\r\nTo make clearer for the audience, we have to add horizontal lines to differentiate the age groups.\r\nRight click the chart and select Format.\r\nSelect the Border icon and go to Columns tab. Click on Grid Lines and select the Solid Line. Choose Dark Grey colour as well.\r\nAnd we got our first dumbbell chart for all age groups.\r\nTo create the second dumbbell chart, right click the current sheet and click Duplicate.\r\nThe aggregated age groups for LFPR are already available in the dataset so we just need to click on the Age Group filter and select Edit Filter.\r\nSelect the following three age groups: 15-24, 25-64, 65 & Over.\r\nGo to the Circle chart under Mark and adjust the Size accordingly. In this case, the slider is at approximately 5% mark.\r\nAnd you got your second dumbbell chart for the aggregated age groups!\r\nDashboard & Final Data Visualisation\r\nFor the dashboard, we inserted a more explanatory title “How does Singapore Resident Labour Force changed from 2009 to 2019” at the top and a clearer lead-in statement stating the overall finding of the visualisation which is that the Singapore Resident Labour Force has gotten OLDER from 2009 to 2019.\r\nThe charts are also strategically placed such that the axes of all 4 charts are aligned and comparable to one another, as seen in the screenshot below.\r\nA legend is also added at the top right corner which is universally used by all 4 charts.\r\ndashboarde. Describe three major observations revealed by the data visualisation prepared.\r\nThe resident labour force has gotten older with more and more elderly/potential retirees (aged 65 & above) remaining in the workforce. Labour force aged 65 and above has % share of resident labour force of 7.12% in 2019, up from 3.02% in 2009.The LPFR for the same age group has increased more than 10% from 2009 to 2019.\r\nThere is a noticeable increasing trend in the % share of resident labour force for resident labour aged 55 and above while the opposite is observed for resident labour aged below 55. This is a potential indication of an aging population.\r\nLFPR for age group 65-69 has the highest increase of 16.2% from 2009 to 2019. This could means that there is better recognition of our older and more experienced resident labour by their company and more of them are being re-employed after reaching retirement age of 62.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-28T17:34:43+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-01-11-my-first-post/",
    "title": "My First Post",
    "description": "This post is part of a tutorial to let us learn about Distill for R Markdown.",
    "author": [
      {
        "name": "Lance Teo",
        "url": "https://www.linkedin.com/in/lanceteoct/"
      }
    ],
    "date": "2021-01-11",
    "categories": [],
    "contents": "\r\n1.0 Overview\r\nCorrelation coefficient is a popular statistic that use to measure the type and strength of the relationship between two variables. The values of a correlation coefficient ranges between -1.0 and 1.0. A correlation coefficient of 1 shows a perfect linear relationship between the two variables, while a -1.0 shows a perfect inverse relationship between the two variables. A correlation coeficient of 0.0 shows no linear relationship between the two variables.\r\nWhen multivariate data are used, the correlation coefficients of the pair comparisons are displayed in a table form known as correlation matrix or scatterplot matrix.\r\nThere are three broad reasons for computing a correlation matrix.\r\nTo reveal the relationship between high dimensional variables pair-wisely.\r\nTo input into other analyses. For example, people commonly use correlation matrices as inputs for exploratory factor analysis, confirmatory factor analysis, structural equation models, and linear regression when excluding missing values pairwise.\r\nAs a diagnostic when checking other analyses. For example, with linear regression a high amount of correlations suggests that the linear regression’s estimates will be unreliable.\r\nWhen the data is large, both in terms of the number of observations and the number of variables, Corrgram tend to be used to visually explore and analyse the structure and the patterns of relations among variables. It is designed based on two main schemes:\r\nRendering the value of a correlation to depict its sign and magnitude, and\r\nReordering the variables in a correlation matrix so that “similar” variables are positioned adjacently, facilitating perception.\r\nIn this hands-on exercise, you will learn how to plot data visualisation for visualising correlation matrix with R. It consists of three main sections. First, you will learn how to create correlation matrix using pairs() of R Graphics. Next, you will learn how to plot corrgram using corrplot package of R Lastly, you will learn how to create an interactive correlation matrix using plotly R. .\r\n2.0 Installing and Launching R Packages\r\nBefore you get started, you are required:\r\nto start a new R project, and\r\nto create a new R Markdown document.\r\nNext, you will use the code chunk below to install and launch corrplot, ggpubr, plotly and tidyverse in RStudio.\r\n\r\n\r\npackages = c('ggpubr', 'tidyverse')\r\n\r\nfor(p in packages){library\r\n  if(!require(p, character.only = T)){\r\n    install.packages(p)\r\n  }\r\n  library(p, character.only = T)\r\n}\r\n\r\n\r\n\r\n3.0 Importing and Preparing The Data Set\r\nIn this hands-on exercise, the Wine Quality Data Set of UCI Machine Learning Repository will be used. The data set consists of 13 variables and 6497 observations. For the purpose of this exercise, we have combined the red wine and white wine data into one data file. It is called wine_quality and is in csv file format.\r\n3.1 Importing Data\r\nFirst, let us import the data into R by using read_csv() of readr package.\r\n\r\n\r\nwine <- read_csv(\"data/wine_quality.csv\")\r\n\r\n\r\n\r\nNotice that beside quality and type, the rest of the variables are numerical and continuous data type.\r\n4.0 Univariate EDA with Histogram\r\nIn the figure below, multiple histograms are plottted to reveal the distribution of the selected variables in the wine quality data sets.\r\n\r\n\r\n\r\nThe code chunks used to create the data visualisation consists of two main parts. First, we will create the individual histograms using the code chunk below.\r\n\r\n\r\nfa <- ggplot(data=wine, aes(x= `fixed acidity`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nva <- ggplot(data=wine, aes(x= `volatile acidity`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nca <- ggplot(data=wine, aes(x= `citric acid`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nrs <- ggplot(data=wine, aes(x= `residual sugar`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nch <- ggplot(data=wine, aes(x= `chlorides`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nfSO2 <- ggplot(data=wine, aes(x= `free sulfur dioxide`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\ntSO2 <- ggplot(data=wine, aes(x= `total sulfur dioxide`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\ndensity <- ggplot(data=wine, aes(x= density)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\npH <- ggplot(data=wine, aes(x= pH)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nsulphates <- ggplot(data=wine, aes(x= sulphates)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nalcohol <- ggplot(data=wine, aes(x= alcohol)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\n\r\n\r\n\r\nNext, the ggarrange function of ggpur package is used to group these histograms together.\r\n\r\n\r\nggarrange(fa, va, ca, rs, ch, fSO2, tSO2, density, pH, sulphates, alcohol, \r\n          ncol = 4, nrow = 3)\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-01-11-my-first-post/my-first-post_files/figure-html5/unnamed-chunk-3-1.png",
    "last_modified": "2021-01-27T00:14:33+08:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to Lance's Visual Analytics Journey!",
    "description": "Welcome to my blog on a Visual Analytics Journey!    \n\nThis blog is part of a course called \"Visual Analytics and Application\" conducted by Prof Kam Tin Seong in the \nSingapore Management University (SMU).    \n\nI will be posting various Data Visualisation Makeovers \nas part of the course deliverables and also be posting on our Data Visualisation Project.    \n\nFeel free to give feedbacks on our work. Thank you!",
    "author": [
      {
        "name": "Lance Teo Chye Teck",
        "url": "https://www.linkedin.com/in/lanceteoct/"
      }
    ],
    "date": "2021-01-11",
    "categories": [],
    "contents": "\r\nImage of GitHub Mascot\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-02-19T05:07:48+08:00",
    "input_file": {}
  }
]
